project05/app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate page: params[:page], order: 'created_at desc', per_page: 10
---
SELECT "articles".* FROM "articles" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(params[:article])
    @article.edits=0;
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("author", "body", "created_at", "edits", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])
    @article.edits=@article.edits+1;
    @back_to = params[:back_to]
    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "author" = 'Author 1', "updated_at" = '2012-02-21 01:28:22.461316' WHERE "articles"."id" = 1