project05/app/controllers/authors_controller.rb

  def edit
    @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "name", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)